<?php
$servername = "localhost"; // Замініть це на адресу сервера бази даних
$username = "root"; // Замініть це на ім'я користувача бази даних
$password = "root"; // Замініть це на пароль для доступу до бази даних
$dbname = "songs"; // Замініть це на ім'я бази даних

// Підключення до бази даних
$conn = new mysqli($servername, $username, $password, $dbname);

// Перевірка наявності помилок при підключенні
if ($conn->connect_error) {
    die("Connection failed: " . $conn->connect_error);
}

// Встановлення кодування для забезпечення правильного відображення символів
$conn->set_charset("utf8");

// Тут ви можете виконати різні операції з базою даних

// Закриття з'єднання з базою даних після виконання всіх операцій
$conn->close();
?>
